{
  "home-title": "Accessibility testing",
  "getstarted": "GET STARTED",
  "learnmore": "LEARN MORE",
  "library-title": "Accessible components library",
  "library-content": "Introducing the Accessible Components Library, your go-to resource for inclusive web development. Explore our wide range of accessibility-focused components designed to enhance user experience. Build an inclusive digital world with the Accessible Components Library.",
  "backtop": "Back to the top",
  "nav-home": "Home",
  "nav-about": "About",
  "main-content-button": "Main content",
  "previous": "Previous",
  "next": "Next",
  "start": "Start",
  "return-home": "Return to home",
  "article-title": "This is a testing zone",
  "fake-title": "And it is not accessible !",
  "true-title": "And it is accessible !",
  "first-name": "First Name",
  "last-name": "Last Name",
  "message": "Hello there !",
  "city": "City",
  "state": "State",
  "zip": "Zip",
  "send": "Send Form",
  "image-error": "This image do not have the following attributes: alt='' aria-hidden='true' role='presentation'.",
  "images-error": "Images do not have the following attributes: alt='' aria-hidden='true' role='presentation'.",
  "form-error": "The tags used in the form are not semantically correct. For example there is no label tags wrapped around the input tags.",
  "select-error": "The select menu doesn't have the aria-expanded attribute.",
  "title-error": "The semantic hierarchy of title tags is inconsistent.",
  "stepper-error": "Buttons have no aria-label or type attribute, and cannot be moved by keyboard keys. And images do not have the following attributes: alt='' aria-hidden='true' role='presentation'.",
  "image-right": "This image has the following attributes: alt='', aria-hidden='true', and role='presentation'.",
  "images-right": "Images have the following attributes: alt='', aria-hidden='true', and role='presentation'.",
  "form-right": "The tags used in the form are semantically correct. For example, there are label tags wrapped around the input tags.",
  "select-right": "The select menu has the aria-expanded attribute.",
  "title-right": "The semantic hierarchy of title tags is consistent.",
  "stepper-right": "Buttons have the aria-label or type attribute, and can be moved by keyboard keys. Additionally, images have the following attributes: alt='', aria-hidden='true', and role='presentation'.",
  "close": "Close",
  "inolib": "Inolib is a digital agency specializing in digital accessibility, whose mission is to make the digital world accessible to all. Since its creation in 2022, Inolib has been designing, developing and marketing solutions and services to promote digital inclusion. The agency is deeply committed to the social economy, combining economic performance with social impact.",
  "step-1": "Welcome to our accessible component testing area! This area is designed to allow you to explore and test the accessibility of an application's components. Today, we're going to present you with two pages: one with non-accessible components and another with accessible components. Ready to get started?",
  "step-2": "On the first test page, you'll see components that aren't accessible to the disabled. Next to each component, a '! Click on it to find out more. Use a screen reader (NVDA or JAWS) and test keyboard navigation with TAB, right/left arrows.",
  "step-3": "When you click on the 'Details' button of a component that is not accessible, you'll see a detailed explanation of why the component is problematic.",
  "step-4": "Now let's move on to the second page, where you'll find components specially designed to be accessible to all users. Interact with these components to see how they are designed to provide an inclusive experience for all."
}
