{
  "home-title": "Test d'accessibilité",
  "getstarted": "TUTORIEL",
  "learnmore": "Découvrir",
  "library-title": "Bibliothèque de composants accessibles",
  "library-content": "Voici la bibliothèque des composants accessibles, votre ressource de référence pour le développement de sites web inclusifs. Explorez notre large gamme de composants axés sur l'accessibilité et conçus pour améliorer l'expérience de l'utilisateur. Construisez un monde numérique inclusif avec la bibliothèque de composants accessibles.",
  "backtop": "Retournez en haut",
  "nav-home": "Accueil",
  "nav-about": "À propos",
  "main-content-button": "Contenu principal",
  "about-us": "À propos de nous",
  "previous": "Précédent",
  "next": "Suivant",
  "library": "LIBRAIRIE",
  "start": "Commencez",
  "return-home": "Retour à l'accueil",
  "article-title": "Ceci est une zone de test",
  "fake-title": "et elle n'est pas accessible !",
  "true-title": "et elle est accessible !",
  "first-name": "Prénom",
  "last-name": "Nom",
  "message": "Salut !",
  "city": "Ville",
  "state": "Pays",
  "zip": "Code postal",
  "send": "Envoyez le formulaire",
  "image-error": "Cette image ne possède pas les attributs suivants : alt='' aria-hidden='true' role='presentation'.",
  "images-error": "Les images ne possèdent pas les attributs suivants : alt='' aria-hidden='true' role='presentation'.",
  "form-error": "Les balises utilisées dans le formulaire ne sont pas correctement sémantiques. Par exemple, il n'y a pas de balises 'label' autour des balises 'input'.",
  "select-error": "Le menu de sélection ne possède pas l'attribut aria-expanded.",
  "title-error": "La hiérarchie sémantique des balises 'title' est incohérente.",
  "stepper-error": "Les boutons ne possèdent pas d'attribut aria-label ou type, et ne peuvent pas être déplacés à l'aide des touches du clavier. De plus, les images ne possèdent pas les attributs suivants : alt='' aria-hidden='true' role='presentation'.",
  "image-right": "Cette image a les attributs suivants : alt='', aria-hidden='true' et role='presentation'.",
  "images-right": "Les images ont les attributs suivants : alt='', aria-hidden='true' et role='presentation'.",
  "form-right": "Les balises utilisées dans le formulaire sont correctes sur le plan sémantique. Par exemple, il y a des balises label autour des balises input.",
  "select-right": "Le menu de sélection a l'attribut aria-expanded.",
  "title-right": "La hiérarchie sémantique des balises de titre est cohérente.",
  "stepper-right": "Les boutons ont l'attribut aria-label ou type et peuvent être déplacés à l'aide des touches du clavier. De plus, les images ont les attributs suivants : alt='', aria-hidden='true' et role='presentation'.",
  "close": "Fermer",
  "open": "Ouvrir",
  "inolib": "Inolib est une agence digitale spécialisée dans l'accessibilité numérique, dont la mission est de rendre le numérique accessible à tous. Depuis sa création en 2022, Inolib conçoit, développe et commercialise des solutions et des services visant à favoriser l'inclusion numérique. L'agence est profondément engagée dans l'économie sociale et solidaire, alliant performance économique et impact social.",
  "step-1": "Bienvenue dans notre zone de tests de composants accessible ! Cette zone est conçue pour vous permettre d'explorer et de tester l'accessibilité des composants d'une application. Aujourd'hui, nous allons vous présenter deux pages : une avec des composants non accessibles et une autre avec des composants accessibles. Prêt à commencer ?",
  "step-2": "Sur la première page de test, vous verrez des composants non accessibles aux personnes handicapées. À côté de chaque composant, un bouton '!' indique le problème. Cliquez dessus pour en savoir plus. Utilisez un lecteur d'écran (NVDA ou JAWS) et testez la navigation au clavier avec TAB, flèches droite/gauche.",
  "step-3": "Lorsque vous cliquez sur le bouton 'Détails' d'un composant non accessible, vous verrez une explication détaillée de la raison pour laquelle le composant pose problème.",
  "step-4": "Maintenant, passons à la deuxième page où vous trouverez des composants spécialement conçus pour être accessibles à tous les utilisateurs. Interagissez avec ces composants pour constater comment ils sont conçus pour offrir une expérience inclusive à tous.",
  "code-pres": "Ce code est conçu pour rendre votre site web accessible aux utilisateurs, y compris ceux qui ont des limitations visuelles ou motrices. Les bonnes pratiques d'accessibilité ont été prises en compte pour offrir une expérience inclusive à tous les utilisateurs. Voici comment cela est réalisé : ",
  "lnav-1": "Utilisation de balises sémantiques : Les balises utilisées, telles que <nav>, <ul>, <li>, et <a>, ont des significations spécifiques pour les lecteurs d'écran et autres technologies d'assistance. Elles aident les utilisateurs à comprendre la structure et la fonctionnalité de la barre de navigation.",
  "lnav-2": "Contrôles accessibles au clavier : Les utilisateurs qui ne peuvent pas utiliser une souris ou un écran tactile peuvent naviguer dans la barre de navigation à l'aide du clavier. Les éléments interactifs, tels que les boutons et les liens, sont conçus pour être activés en appuyant sur la touche Entrée ouEspace lorsqu'ils sont en surbrillance.",
  "lnav-3": "Contraste visuel : Les couleurs utilisées pour le texte et l'arrière-plan de la barre de navigation ont été choisies pour offrir un bon contraste, facilitant la lisibilité pour les personnes ayant une vision réduite ou une sensibilité aux couleurs.",
  "lnav-4": "Gestion de l'état du menu : Lorsque vous cliquez sur l'icône de hamburger, le menu s'ouvre et se ferme. Cette fonctionnalité permet aux utilisateurs de comprendre si le menu est ouvert ou fermé, même s'ils ne peuvent pas voir l'icône.",
  "date-1": "Navigation au clavier : Les boîtes de sélection de date doivent être utilisables uniquement à l'aide de la navigation au clavier. Les utilisateurs doivent pouvoir naviguer entre les options, sélectionner une date et confirmer leur choix en utilisant uniquement le clavier, sans dépendre de la souris ou du toucher.",
  "date-2": "Prise en charge des lecteurs d'écran : Les boîtes de sélection de date doivent être conçues pour fonctionner parfaitement avec les lecteurs d'écran. Cela comprend la fourniture de libellés et de descriptions appropriés pour la boîte de sélection et ses composants, ainsi que la transmission de la date sélectionnée et de toute modification à l'utilisateur.",
  "date-3": "Indicateur de focus clair : Un indicateur de focus clair et visible doit être fourni pour mettre en évidence l'élément actuellement sélectionné dans la boîte de sélection de date. Cela aide les utilisateurs qui se déplacent au clavier à identifier facilement quel élément est actuellement actif.",
  "date-4": "Validation des dates : La boîte de sélection de date doit comporter une validation intégrée pour garantir que seules des dates valides peuvent être sélectionnées. Si une date invalide est saisie manuellement, la boîte de sélection doit fournir un message d'erreur ou une rétroaction visuelle pour indiquer le problème.",
  "larticle-1": "Les balises HTML sont utilisées de manière appropriée : Le code utilise des balises sémantiques telles que <article>, <section>, <h1>, <h2>, <p>, etc., ce qui améliore l'accessibilité pour les lecteurs d'écran et facilite la compréhension de la structure de la page pour tous les utilisateurs.",
  "larticle-2": "Les attributs alt et aria-hidden sont utilisés pour les images : Les images incluses dans le code ont des attributs alt et aria-hidden définis, ce qui permet aux lecteurs d'écran de comprendre le contenu des images et de les ignorer lorsqu'elles ne sont pas pertinentes pour le contexte.",
  "larticle-3": "Les classes CSS sont utilisées de manière adaptative : Le code utilise des classes CSS adaptatives, telles que md:mt-0, sm:px-6, lg:px-8, etc., qui permettent de modifier le style en fonction de la taille de l'écran. Cela garantit que le contenu reste lisible et bien disposé sur différents appareils et résolutions d'écran.",
  "larticle-4": "La structure de lecture est cohérente : Le code suit une structure de lecture logique avec des balises appropriées pour les titres, les sous-titres et les paragraphes. Cela facilite la navigation et la compréhension du contenu pour les utilisateurs qui dépendent de la structure de la page pour accéder à l'information.",
  "lstep-1": "Le code utilise des attributs accessibilité tels que role, aria-roledescription et aria-label pour décrire les éléments et fournir des informations aux technologies d'assistance.",
  "lstep-2": "Il gère le focus clavier en utilisant les événements onKeyDown et une fonction personnalisée horizontalFocus, permettant aux utilisateurs de naviguer dans les étapes du tutoriel à l'aide du clavier.",
  "lstep-3": "Les images utilisées dans le tutoriel sont accompagnées d'un attribut alt qui fournit une description alternative pour les utilisateurs qui ne peuvent pas voir l'image.",
  "lstep-4": "Le code utilise des attributs tabIndex pour rendre les boutons du tutoriel accessibles au clavier. En attribuant une valeur de 0 au tabIndex, les boutons deviennent focusables et peuvent être activés en appuyant sur la touche Entrée ou la barre d'espace. Cela permet aux utilisateurs qui ne peuvent pas utiliser la souris de naviguer et d'interagir avec les boutons du tutoriel en utilisant uniquement le clavier.",
  "lform-1": "Les éléments de formulaire (balises <input>, <textarea>, <select>, etc.) sont tous associés à des étiquettes (<label>) appropriées à l'aide de l'attribut htmlFor (ou for en HTML), ce qui permet aux lecteurs d'écran de les associer correctement et d'annoncer l'étiquette correspondante lorsqu'un élément de formulaire reçoit le focus.",
  "lform-2": "Les étiquettes sont écrites de manière descriptive, ce qui facilite la compréhension pour les utilisateurs ayant des difficultés de lecture ou de vision.",
  "lform-3": "Les contrôles de formulaire ont des styles et des attributs (aria-*) appropriés pour fournir des indices visuels et contextuels aux utilisateurs, en particulier ceux qui utilisent des lecteurs d'écran.",
  "lform-4": "Les boutons ont des textes explicites et des classes CSS appropriées pour indiquer leur rôle (par exemple, le bouton 'send' indique clairement son objectif).",
  "lswitch-1": "Utilisation appropriée des rôles et des attributs ARIA : Le bouton dans ce code utilise les attributs ARIA (Accessible Rich Internet Applications) pour améliorer l'accessibilité. L'attribut role='switch' indique que le bouton agit comme un interrupteur. L'attribut aria-checked={isChecked} est utilisé pour indiquer l'état actuel de l'interrupteur, en fonction de la valeur de isChecked.",
  "lswitch-2": "Gestion du clavier : L'événement onKeyDown est utilisé pour détecter les touches du clavier pressées par l'utilisateur. Si l'utilisateur appuie sur la touche Enter ou sur la touche Espace, la fonction handleSwitch est appelée pour changer l'état de l'interrupteur.",
  "lswitch-3": "Texte alternatif : L'attribut aria-label fournit un texte alternatif pour l'interrupteur, ce qui est utile pour les lecteurs d'écran ou toute autre technologie d'assistance.",
  "lswitch-4": "Styles visuels distincts pour les états : Les classes CSS conditionnelles sont utilisées pour appliquer des styles visuels distincts en fonction de l'état de l'interrupteur. Cela permet aux utilisateurs ayant une déficience visuelle de distinguer clairement l'état actuel de l'interrupteur.",
  "ltabs-1": "Utilisation de role et aria-* : Les balises HTML utilisées, telles que role et aria-*, permettent d'ajouter des attributs accessibles aux éléments interactifs, tels que les onglets et les panneaux, afin de fournir des informations supplémentaires aux technologies d'assistance utilisées par les personnes en situation de handicap.",
  "ltabs-2": "Gestion du focus : Le code utilise un crochet personnalisé appelé useFocus pour gérer le focus clavier sur les onglets. Cela garantit que les utilisateurs peuvent naviguer facilement entre les onglets à l'aide du clavier, ce qui est essentiel pour les personnes ayant des limitations de dextérité ou qui ne peuvent pas utiliser la souris.",
  "ltabs-3": "Utilisation de l'état : Le code utilise le crochet useState pour gérer l'état de l'onglet actif. Cela permet de mettre à jour dynamiquement le contenu affiché en fonction de l'onglet sélectionné par l'utilisateur.",
  "ltabs-4": "Utilisation de références : Le code utilise des références (Refs) pour capturer les éléments de bouton des onglets. Cela permet de les associer aux fonctions de gestion des événements, comme la gestion des clics et de la navigation clavier. Les références sont également utiles pour accéder aux éléments DOM et effectuer des actions spécifiques sur eux.",
  "lmodal-1": "Les attributs aria-labelledby et aria-describedby sont utilisés pour fournir une description textuelle de l'élément dialog, ce qui permet aux utilisateurs de technologies d'assistance de comprendre le contenu et le but du dialogue.",
  "lmodal-2": "La fonction useEscapeKey est utilisée pour détecter lorsque l'utilisateur appuie sur la touche Échap, ce qui permet de fermer le dialogue. Cela est utile pour les utilisateurs qui ne peuvent pas utiliser la souris ou préfèrent naviguer uniquement au clavier.",
  "lmodal-3": "La fonction useOuterClick est utilisée pour détecter lorsque l'utilisateur clique en dehors du dialogue, ce qui permet également de le fermer. Cela améliore l'expérience utilisateur en permettant de fermer le dialogue de différentes manières, que ce soit en appuyant sur Échap ou en cliquant à l'extérieur.",
  "lmodal-4": "Les attributs aria-label et role sont utilisés pour indiquer la nature du dialogue et fournir une information contextuelle supplémentaire pour les utilisateurs de technologies d'assistance.",
  "multi-1": "Libellés clairs et descriptifs : Chaque étape du formulaire doit comporter des libellés clairs et descriptifs pour tous les champs de saisie, les cases à cocher, les boutons radio et les menus déroulants. Les libellés doivent fournir suffisamment d'informations pour guider les utilisateurs et les aider à comprendre l'objectif de chaque champ.",
  "multi-2": "Gestion des erreurs et validation : Le formulaire doit inclure des mécanismes appropriés de gestion des erreurs et de validation pour s'assurer que les utilisateurs reçoivent des commentaires clairs en cas d'erreur ou s'ils oublient de remplir des champs obligatoires. Les messages d'erreur doivent être descriptifs, spécifiques et présentés de manière claire et visible.",
  "multi-3": "Accessibilité au clavier : Les utilisateurs doivent pouvoir naviguer et interagir avec le formulaire à plusieurs étapes en utilisant uniquement le clavier, sans avoir besoin d'une souris ou d'autres dispositifs de pointage. Cela comprend la fourniture d'indicateurs de focus clairs, en veillant à l'ordre logique des onglets et en prenant en charge les raccourcis clavier pour la navigation entre les étapes.",
  "multi-4": "Indicateurs de progression clairs : Le formulaire doit fournir des indicateurs de progression clairs et visibles pour informer les utilisateurs de l'étape en cours et de l'avancement global du formulaire. Cela permet aux utilisateurs de comprendre combien d'informations supplémentaires sont requises et leur permet de naviguer d'avant en arrière entre les étapes si nécessaire. Les indicateurs de progression doivent être accessibles aux lecteurs d'écran et aux technologies d'assistance.",
  "aria-modal": "Fenêtre d'erreur d'accessibilité",
  "aria-language": "Changer de langue",
  "aria-step": "Fenêtre de tutoriel",
  "aria-previous": "étape précédente",
  "aria-next": "étape suivante",
  "aria-start": "commencer",
  "aria-fastAccess": "Aller au contenu principal",
  "aria-language-button": "langue",
  "aria-dark-mode": "mode sombre",
  "aria-switch": "Basculer l'interrupteur",
  "alt-img-info": "Graphiques des utilisateurs des 7 derniers jours",
  "alt-img-fonct": "Accueil W3C",
  "alt-img-details": "Diagramme à barres montrant les visiteurs mensuels et totaux pour le premier trimestre 2014 pour les sites 1 à 3",
  "img-deco": "Image décorative",
  "img-info": "Image informatives",
  "img-fonct": "Image fonctionnelles",
  "img-text": "Image de texte",
  "img-details": "Image détaillés",
  "sur": "sur",
  "Étape": "Étape",
  "text-lorem": "Dans une vallée lointaine, les fleurs dansaient au rythme du vent printanier. Leurs pétales colorés créaient un tableau vivant sous le soleil radieux. Les abeilles bourdonnaient avec joie, récoltant le nectar sucré pour leur ruche bien-aimée. C'était un spectacle enchanteur qui émerveillait les âmes en quête de beauté.",
  "aria-testing-zone": "Vous êtes dans la zone de test"
}
